public_html/Communication/freeradius.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Freeradius and daloRADIUS</title>
<!-- 2017-08-10 Thu 21:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Shi Shougang" />
<link href="../assets/bootstrap.min.css" rel="stylesheet" media="screen">
<link href="../assets/bootstrap-responsive.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../assets/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Freeradius and daloRADIUS</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Install FreeRADIUS On Ubuntu</a>
<ul>
<li><a href="#sec-2-1">Install FreeRADIUS</a></li>
<li><a href="#sec-2-2">Verify FreeRADIUS version</a></li>
<li><a href="#sec-2-3">Run a quick config check</a></li>
<li><a href="#sec-2-4">Review the Configuration Files</a></li>
<li><a href="#sec-2-5">Add Clients</a></li>
<li><a href="#sec-2-6">Define EAP Methods</a></li>
<li><a href="#sec-2-7">Add Users</a></li>
<li><a href="#sec-2-8">Start FreeRadius and check</a></li>
<li><a href="#sec-2-9">Test Authentication</a></li>
</ul>
</li>
<li><a href="#sec-3">cc</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>freeradius: <a href="http://freeradius.org/">http://freeradius.org/</a>, windows: <a href="http://freeradius.net/">http://freeradius.net/</a>
</li>
<li>daloRADIUS is an advanced RADIUS <b>web platform</b> aimed at managing
Hotspots and general-purpose ISP deployments. It features rich user
management, graphical reporting, accounting, and integrates with
GoogleMaps for geo-locating (GIS). <a href="http://www.daloradius.com/">http://www.daloradius.com/</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Install FreeRADIUS On Ubuntu</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Install FreeRADIUS</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install freeradius
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Verify FreeRADIUS version</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh">$ freeradius -v
freeradius: FreeRADIUS Version 2.1.12, for host x86_64-pc-linux-gnu, built on Jul 26 2017 at 15:30:42
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Run a quick config check</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-sh">$ sudo freeradius -CX
...
Configuration appears to be OK.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4">Review the Configuration Files</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The FreeRADIUS files are located in: <code>/etc/freeradius</code>.
</p>
</div>
<ul class="org-ul"><li><a id="sec-2-4-1" name="sec-2-4-1"></a>Max number of requests<br  /><div class="outline-text-4" id="text-2-4-1">
<p>
Increase the default value of 1024 if you’re planning on having more
than 4 clients authenticating at a time.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">max_requests: The maximum number of requests which the server keeps</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">track of.  This should be 256 multiplied by the number of clients.</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">e.g. With 4 clients, this number should be 1024.</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">If this number is too low, then when the server becomes busy,</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">it will not respond to any new requests, until the 'cleanup_delay'</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">time has passed, and it has removed the old requests.</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">If this number is set too high, then the server will use a bit more</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">memory for no real benefit.</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">If you aren't sure what it should be set to, it's better to set it</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">too high than too low.  Setting it to 1000 per client is probably</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">the highest it should be.</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #ff7f24;">#  </span><span style="color: #ff7f24;">Useful range of values: 256 to infinity</span>
<span style="color: #ff7f24;">#</span>
<span style="color: #eedd82;">max_requests</span> = 1024
</pre>
</div>
</div>
</li></ul>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5">Add Clients</h3>
<div class="outline-text-3" id="text-2-5">
<p>
add into the file <code>clients.conf</code>
</p>
<div class="org-src-container">

<pre class="src src-sh">client P6-MOJO-1 {
    <span style="color: #eedd82;">ipaddr</span> = 192.168.130.20
    <span style="color: #eedd82;">secret</span> = strong-passphrase-here
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6">Define EAP Methods</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>eap.conf</code>: By default, FreeRadius will use MD5 which is not very strong.
</p>
</div>
</div>
<div id="outline-container-sec-2-7" class="outline-3">
<h3 id="sec-2-7">Add Users</h3>
<div class="outline-text-3" id="text-2-7">
<p>
Let’s add users which will authenticate to this RADIUS server. Edit
the <code>users</code> file.
</p>

<div class="org-src-container">

<pre class="src src-sh">test Cleartext-Password := <span style="color: #ffa07a;">"test"</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">Cleartext-Password = statement indicating we are going to assign a clear text password to this username. Notice that &#8220;:=&#8220; is used for assignment.
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-8" class="outline-3">
<h3 id="sec-2-8">Start FreeRadius and check</h3>
<div class="outline-text-3" id="text-2-8">
<div class="org-src-container">

<pre class="src src-sh">$ sudo service freeradius restart
freeradius stop/waiting
freeradius start/running, process 29805
$ sudo service freeradius status
freeradius start/running, process 29805
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-9" class="outline-3">
<h3 id="sec-2-9">Test Authentication</h3>
<div class="outline-text-3" id="text-2-9">
<p>
Run a quick test to see if FreeRADIUS will accept the newly created
username and password. 
</p>

<div class="org-src-container">

<pre class="src src-sh">$ radtest test test 127.0.0.1 0 testing123
Sending Access-Request of id 145 to 127.0.0.1 port 1812
        User-Name = <span style="color: #ffa07a;">"test"</span>
        User-Password = <span style="color: #ffa07a;">"test"</span>
        NAS-IP-Address = 127.0.1.1
        NAS-Port = 0
        Message-Authenticator = 0x00000000000000000000000000000000
rad_recv: Access-Accept packet from host 127.0.0.1 port 1812, <span style="color: #eedd82;">id</span>=145, <span style="color: #eedd82;">length</span>=20
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">cc</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-sh"></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shi Shougang</p>
<p class="date">Created: 2017-08-10 Thu 21:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
